import random
# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений
# в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества.
# Затем пользователь вводит сами элементы множеств.

n = int(input("Введите количество элементов 1 набора: "))
m = int(input("Введите количество элементов 2 набора: "))
array1 = []
array2 = []
for i in range(n):
    array1.append(random.randint(1, n))
for j in range(m):
    array2.append(random.randint(1, m))
print(array1)
print(array2)

print(*sorted(set(array1 + array2)))
